In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

#Ans(a)
print("Name- Md. Aminul Islam")
print("Id.No- CSE1803015044")
print("Section- 15A")
print("Course Code- CSE424")
print("Course Tittle- Simulation and Modelling Sessional")

Name- Md. Aminul Islam
Id.No- CSE1803015044
Section- 15A
Course Code- CSE424
Course Tittle- Simulation and Modelling Sessional

In [22]:
df= pd.read_csv('age-facebook.csv')

df

    age  has_facebook_account
0    24                   1.0
1    21                   1.0
2    10                   0.0
3    58                   1.0
4    16                   0.0
5    56                   0.0
6    28                   1.0
7    13                   0.0
8    18                   1.0
9    17                   1.0
10   80                   0.0
11   12                   0.0
12   44                   1.0
13    6                   0.0
14   25                   1.0
15   67                   0.0
16    1                   0.0
17   26                   1.0
18   22                   NaN
19   23                   1.0

In [23]:
#Ans(b)
df.head(5)

   age  has_facebook_account
0   24                   1.0
1   21                   1.0
2   10                   0.0
3   58                   1.0
4   16                   0.0

In [24]:
#Ans(b)
df.tail(5)

    age  has_facebook_account
15   67                   0.0
16    1                   0.0
17   26                   1.0
18   22                   NaN
19   23                   1.0

In [55]:
#Ans(c)
df.shape

(20, 2)

In [54]:
#Ans(d)
df.isnull().any

<bound method NDFrame._add_numeric_operations.<locals>.any of       age  has_facebook_account
0   False                 False
1   False                 False
2   False                 False
3   False                 False
4   False                 False
5   False                 False
6   False                 False
7   False                 False
8   False                 False
9   False                 False
10  False                 False
11  False                 False
12  False                 False
13  False                 False
14  False                 False
15  False                 False
16  False                 False
17  False                 False
18  False                 False
19  False                 False>

In [26]:
df.isnull().sum()

age                     0
has_facebook_account    1
dtype: int64

In [28]:
Median = df["has_facebook_account"].median()
print(Median)

1.0

In [30]:
#Ans(e)
df.has_facebook_account = df.has_facebook_account.fillna(Median)

In [34]:
df

    age  has_facebook_account
0    24                   1.0
1    21                   1.0
2    10                   0.0
3    58                   1.0
4    16                   0.0
5    56                   0.0
6    28                   1.0
7    13                   0.0
8    18                   1.0
9    17                   1.0
10   80                   0.0
11   12                   0.0
12   44                   1.0
13    6                   0.0
14   25                   1.0
15   67                   0.0
16    1                   0.0
17   26                   1.0
18   22                   1.0
19   23                   1.0

In [33]:
#Ans(f)

x=df[['age']]

In [35]:
#Ans(g)

df['has_facebook_account'].value_counts()

1.0    11
0.0     9
Name: has_facebook_account, dtype: int64

In [37]:
#Ans(h)

x

    age
0    24
1    21
2    10
3    58
4    16
5    56
6    28
7    13
8    18
9    17
10   80
11   12
12   44
13    6
14   25
15   67
16    1
17   26
18   22
19   23

In [38]:
y=df['has_facebook_account']

In [39]:
y

0     1.0
1     1.0
2     0.0
3     1.0
4     0.0
5     0.0
6     1.0
7     0.0
8     1.0
9     1.0
10    0.0
11    0.0
12    1.0
13    0.0
14    1.0
15    0.0
16    0.0
17    1.0
18    1.0
19    1.0
Name: has_facebook_account, dtype: float64

In [40]:
#Ans(i)

from sklearn.model_selection import train_test_split

In [43]:
xtrain,xtest, ytrain, ytest= train_test_split(x,y,test_size=.3,random_state=1)

In [44]:
xtrain

    age
4    16
17   26
7    13
1    21
13    6
0    24
19   23
18   22
9    17
15   67
8    18
12   44
11   12
5    56

In [45]:
from sklearn.linear_model import LogisticRegression

In [46]:
model=LogisticRegression()

In [47]:
model.fit(xtrain,ytrain)

LogisticRegression()

In [48]:
ytest

3     1.0
16    0.0
6     1.0
10    0.0
2     0.0
14    1.0
Name: has_facebook_account, dtype: float64

In [50]:
#Ans(j)

model.predict([[3]])

array([1.])

In [51]:
model.predict([[23]])

array([1.])

In [52]:
#Ans(k)

model.score(xtest,ytest)

0.5